IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/GPIOB_1.0.xml
    <register id="GPIOB_POLARITY31_16" width="32" offset="0x13A0" description="Polarity 31 to 16">
        <bitfield id="DIO16" description="Enables and configures edge detection polarity for DIO16." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO17" description="Enables and configures edge detection polarity for DIO17." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO18" description="Enables and configures edge detection polarity for DIO18." begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO19" description="Enables and configures edge detection polarity for DIO19." begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO20" description="Enables and configures edge detection polarity for DIO20." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO21" description="Enables and configures edge detection polarity for DIO21." begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO22" description="Enables and configures edge detection polarity for DIO22." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO23" description="Enables and configures edge detection polarity for DIO23." begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO24" description="Enables and configures edge detection polarity for DIO24." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO25" description="Enables and configures edge detection polarity for DIO25." begin="19" end="18" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO26" description="Enables and configures edge detection polarity for DIO26." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO27" description="Enables and configures edge detection polarity for DIO27." begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO28" description="Enables and configures edge detection polarity for DIO28." begin="25" end="24" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO29" description="Enables and configures edge detection polarity for DIO29." begin="27" end="26" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO30" description="Enables and configures edge detection polarity for DIO30." begin="29" end="28" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO31" description="Enables and configures edge detection polarity for DIO31." begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
    </register>
    <register id="GPIOB_CTL" width="32" offset="0x1400" description="FAST WAKE GLOBAL EN">
        <bitfield id="FASTWAKEONLY" description="FASTWAKEONLY for the global control of fastwake" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOT_GLOBAL_EN" value="0x0" description="The global control of fastwake is not enabled, per bit fast wake feature depends on FASTWAKE.DIN"/>
            <bitenum id="GLOBAL_EN" value="0x1" description="The global control of fastwake is enabled"/>
        </bitfield>
    </register>
    <register id="GPIOB_FASTWAKE" width="32" offset="0x1404" description="FAST WAKE ENABLE">
        <bitfield id="DIN0" description="Enable fastwake feature for DIN0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN1" description="Enable fastwake feature for DIN1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN2" description="Enable fastwake feature for DIN2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN3" description="Enable fastwake feature for DIN3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN4" description="Enable fastwake feature for DIN4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN5" description="Enable fastwake feature for DIN5" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN6" description="Enable fastwake feature for DIN6" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN7" description="Enable fastwake feature for DIN7" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN8" description="Enable fastwake feature for DIN8" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN9" description="Enable fastwake feature for DIN9" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN10" description="Enable fastwake feature for DIN10" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN11" description="Enable fastwake feature for DIN11" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN12" description="Enable fastwake feature for DIN12" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN13" description="Enable fastwake feature for DIN13" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN14" description="Enable fastwake feature for DIN14" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN15" description="Enable fastwake feature for DIN15" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN16" description="Enable fastwake feature for DIN16" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN17" description="Enable fastwake feature for DIN17" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN18" description="Enable fastwake feature for DIN18" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN19" description="Enable fastwake feature for DIN19" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN20" description="Enable fastwake feature for DIN20" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN21" description="Enable fastwake feature for DIN21" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN22" description="Enable fastwake feature for DIN22" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN23" description="Enable fastwake feature for DIN23" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN24" description="Enable fastwake feature for DIN24" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN25" description="Enable fastwake feature for DIN25" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN26" description="Enable fastwake feature for DIN26" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN27" description="Enable fastwake feature for DIN27" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN28" description="Enable fastwake feature for DIN29" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN29" description="Enable fastwake feature for DIN29" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN30" description="Enable fastwake feature for DIN30" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
        <bitfield id="DIN31" description="Enable fastwake feature for DIN31" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="fastwake feature is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="fastwake feature is enabled"/>
        </bitfield>
    </register>
    <register id="GPIOB_SUB0CFG" width="32" offset="0x1500" description="Subscriber 0 configuration">
        <bitfield id="ENABLE" description="This bit is used to enable subscriber 0 event." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Subscriber 0 event is disabled"/>
            <bitenum id="SET" value="0x1" description="Subscriber 0 event is enabled"/>
        </bitfield>
        <bitfield id="OUTPOLICY" description="These bits configure the output policy for subscriber 0 event." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="SET" value="0x0" description="Selected DIO pins are set"/>
            <bitenum id="CLR" value="0x1" description="Selected DIO pins are cleared"/>
            <bitenum id="TOGGLE" value="0x2" description="Selected DIO pins are toggled"/>
        </bitfield>
        <bitfield id="INDEX" description="Indicates the specific bit among lower 16 bits that is targeted by the subscriber action" begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MIN" value="0x0" description="specific bit targeted by the subscriber action is bit0"/>
            <bitenum id="MAX" value="0xF" description="specific bit targeted by the subscriber action is bit15"/>
        </bitfield>
    </register>
