IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/GPIOB_1.0.xml
    <register id="GPIOB_FILTEREN15_0" width="32" offset="0x1508" description="Filter Enable 15 to 0">
        <bitfield id="DIN0" description="Programmable counter length of digital glitch filter for DIN0" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN1" description="Programmable counter length of digital glitch filter for DIN1" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN2" description="Programmable counter length of digital glitch filter for DIN2" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN3" description="Programmable counter length of digital glitch filter for DIN3" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN4" description="Programmable counter length of digital glitch filter for DIN4" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN5" description="Programmable counter length of digital glitch filter for DIN5" begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN6" description="Programmable counter length of digital glitch filter for DIN6" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN7" description="Programmable counter length of digital glitch filter for DIN7" begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN8" description="Programmable counter length of digital glitch filter for DIN8" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN9" description="Programmable counter length of digital glitch filter for DIN9" begin="19" end="18" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN10" description="Programmable counter length of digital glitch filter for DIN10" begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN11" description="Programmable counter length of digital glitch filter for DIN11" begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN12" description="Programmable counter length of digital glitch filter for DIN12" begin="25" end="24" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN13" description="Programmable counter length of digital glitch filter for DIN13" begin="27" end="26" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN14" description="Programmable counter length of digital glitch filter for DIN14" begin="29" end="28" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN15" description="Programmable counter length of digital glitch filter for DIN15" begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
    </register>
